/**
 * Prop — декоратор для позначення властивостей класу як полів у схемі Mongoose.
 * Дозволяє задавати опції (наприклад, required).
 *
 * Schema — декоратор для позначення класу як Mongoose-схеми. Додає метадані,
 * які потрібні для створення схеми.
 *
 * SchemaFactory — утиліта, яка перетворює клас із декораторами
 * у реальну Mongoose-схему (SchemaFactory.createForClass(Book)).
 */
import { Prop, Schema, SchemaFactory } from '@nestjs/mongoose';

/**
 * Document — базовий тип Mongoose для документів у колекції. Додає службові властивості
 * та методи (наприклад, _id, save(), toObject()). Використовується для типізації
 * (BookDocument = Book & Document), щоб працювати з об'єктами з бази даних як з
 * повноцінними Mongoose-документами.
 */
import { Document } from 'mongoose';

/**
 * Book & Document — це комбінований тип, який містить і поля книги, і всі можливості
 * Mongoose-документа. Дозволяє звертатися до властивостей (book.title) і викликати методи
 * (book.save()) без помилок типів.
 *
 * Якби не цей комбінований тип, не було б можливості коректно типізувати змінні, які містять
 * документи з бази. TS не знав би, що у документа є і поля книги, і методи Mongoose.
 * Могли б виникати помилки типів.
 */
export type BookDocument = Book & Document;

/**
 * @Schema декоратор визначає структуру документу у колекції books в MongoDB,
 * а саме які поля має кожна книга (наприклад, title, cover, author).
 * Використовується для створення моделі Mongoose, яка дозволяє виконувати CRUD-операції
 * з книгами у базі даних.
 *
 * Цей декоратор приймає об’єкт-параметр ({ timestamps: true }), що містить метадані
 * для Mongoose, які змінюють поведінку схеми, але не змінюють структуру класу напряму.
 * У цьому випадку timestamps: true каже Mongoose автоматично додавати
 * поля createdAt і updatedAt до кожного документа.
 */
@Schema({ timestamps: true })
export class Book {
  /**
   * @Prop оголошує властивість класу як поле схеми mongoose, його параметр-об'єкт
   * ({required: true}) говорить що властивість буде обов'язковою.
   * Якщо властивість не позначена @Prop, вона не потрапить у схему MongoDB.
   *
   * Додає метадані для Mongoose, щоб правильно згенерувати схему на основі класу.
   *
   * Забезпечує зв’язок між TypeScript-класом і Mongoose-схемою: дозволяє описувати
   * структуру документа у вигляді класу, а не "ручної" схеми.
   */
  @Prop({ required: true })
  title: string;

  /**
   * Декоратор @Prop безпосередньо повинен бути над властивістю, яку він декорує.
   * Ні праворуч, ні ліворуч, саме зверху, це стандартний синтаксис декораторів
   * у TS та JS. І саме так властивість потрапляє до схеми.
   */
  @Prop()
  cover: string;

  @Prop()
  author: string;
}

// SchemaFactory.createForClass() - перетворює клас на mongoose-схему
export const BookSchema = SchemaFactory.createForClass(Book);
